# 演習１８～２０

[Google Colaboratoryで開く](https://colab.research.google.com/github/202408pythonciot/SQL/blob/main/Google_Colab/exercises_18_to_20.ipynb)

<a target="_blank" href="https://colab.research.google.com/github/202408pythonciot/SQL/blob/main/Google_Colab/exercises_18_to_20.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

**sqliteをロード**

In [ ]:
%reload_ext sql
%sql sqlite:///:memory:

**employeeテーブル（従業員表）**を作成

In [ ]:
%%sql
DROP TABLE IF EXISTS employee;
CREATE TABLE "employee" (
	"employee_id"	INTEGER,		-- 従業員番号
	"name"		TEXT NOT NULL,	-- 氏名
	"mail"		TEXT,		-- メールアドレス
	"hire_date"	DATE,		-- 入社日
	"salary"		INTEGER,		-- 月給
	"dept_id"	INTEGER,		-- 所属部門番号
	PRIMARY KEY("employee_id")
);
-- 従業員データ
INSERT INTO employee VALUES(1,'梅津 玲那','umedu_rena@example.com','1987-07-03',452000,2);
INSERT INTO employee VALUES(2,'米谷 朝陽','yoneya_asahi@example.com','1990-10-01',428280,3);
INSERT INTO employee VALUES(3,'古田 沙知絵','furuta_sachie@example.com','1991-02-26',425320,4);
INSERT INTO employee VALUES(4,'細川 ちえみ','hosokawa_chiemi@example.com','2002-11-25',339520,4);
INSERT INTO employee VALUES(5,'宇田川 雅紀','utagawa_masanori@example.com','2002-12-28',338860,5);
INSERT INTO employee VALUES(6,'柴山 恭子','shibayama_kyouko@example.com','2008-06-04',299160,3);
INSERT INTO employee VALUES(7,'竹下 明日','takeshita_meibi@example.com','2019-08-12',217440,5);
INSERT INTO employee VALUES(8,'下山 草太','shimoyama_souta@example.com','2021-01-02',207260,NULL);

 * sqlite:///:memory:
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

**演習１８**
employee表に、従業員番号11として内田 康博さんを追加する。ただしメールアドレス、入社日、月給、所属部門は未定。

In [ ]:
%%sql
INSERT INTO employee(employee_id, name)
VALUES (11,'内田 康博');

In [ ]:
%%sql
SELECT * FROM employee;

**演習１９**
演習１８で追加した内田さんの所属部門番号を1、月給を200000としてデータを更新

In [ ]:
%%sql
UPDATE employee
SET
  salary = 200000,
  dept_id = 1
WHERE employee_id = 11;

 * sqlite:///:memory:
1 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM employee;

 * sqlite:///:memory:
Done.

[(1, '梅津 玲那', 'umedu_rena@example.com', '1987-07-03', 452000, 2),
 (2, '米谷 朝陽', 'yoneya_asahi@example.com', '1990-10-01', 428280, 3),
 (3, '古田 沙知絵', 'furuta_sachie@example.com', '1991-02-26', 425320, 4),
 (4, '細川 ちえみ', 'hosokawa_chiemi@example.com', '2002-11-25', 339520, 4),
 (5, '宇田川 雅紀', 'utagawa_masanori@example.com', '2002-12-28', 338860, 5),
 (6, '柴山 恭子', 'shibayama_kyouko@example.com', '2008-06-04', 299160, 3),
 (7, '竹下 明日', 'takeshita_meibi@example.com', '2019-08-12', 217440, 5),
 (8, '下山 草太', 'shimoyama_souta@example.com', '2021-01-02', 207260, None),
 (11, '内田 康博', None, None, 200000, 1)]

**演習２０**
演習１８で追加した内田さんを削除

In [ ]:
%%sql
DELETE FROM employee WHERE employee_id = 11;